import React from 'react';
import '../scss/modal-txt.scss';

const TermsOfService = () => {
  return (
    // TODO 이용약관
    <div className="TermsOfService modal-txt">
      <b>사용자는 본 웹사이트를 참고하거나 사용하기 전에 다음 약관을 주의 깊게 읽어야 합니다.</b>

      <ul>
        <li>
          www.miumiu.com/kr/ko.html 웹사이트 ("웹사이트")에 오신 것을 환영합니다. 본 웹사이트의
          사용은 다음 이용 약관 ("이용 약관")의 적용을 받습니다. 본 웹사이트에 방문함으로써 귀하는
          조건 없이 다음 이용 약관을 준수하고 해당 약관의 적용을 받는 것에 동의하게 되며, 본
          웹사이트에서 온라인 구매를 하는 경우 관련된 일반 판매 약관을 준수하고 해당 약관의 적용을
          받는 것에 동의하게 됩니다. 이용 약관의 전체 내용에 동의하지 않는 경우 즉시 본 웹사이트
          이용을 중지하여 주시기 바랍니다.
        </li>
        <li>
          본 웹사이트는 PRADA Korea LLC (대한민국 서울에 등기소를 두고) 와 그 모회사인 Prada S.p.A
          (Via Antonio Fogazzaro 28, 20135, Milan, Italy의 주요 사업지 그리고 Prada Group의 운영
          지주 회사로서)에 의해 운영됩니다 (이하 "PRADA"라 한다). 웹 사이트에서 제공되는 제품들은
          Prada Group이 직접 판매합니다.
        </li>
        <li>
          PRADA는 자사의 단독 재량에 따라 본 웹사이트의 이용 약관을 수정할 수 있는 권한을 보유하며,
          비물질적 변경 시 7일 전, 재료 변동 시 30일 전 통지서를 제공합니다. 그러한 약관 수정 이후에
          본 웹사이트를 사용하는 것은 수정된 버전의 이용 약관에 완전히 동의한다는 의미로 간주됩니다.
        </li>
      </ul>
      <ul>
        <li className="title">1. 지적 재산권</li>
        <li>www.miumiu.com/kr/ko.html 웹사이트 ("웹사이트")에 오신 것을 환영합니다. </li>
        <li>본 웹사이트의 사용은 다음 이용 약관 ("이용 약관")의 적용을 받습니다. </li>
        <li>
          본 웹사이트에 방문함으로써 귀하는 조건 없이 다음 이용 약관을 준수하고 해당 약관의 적용을
          받는 것에 동의하게 되며, 본 웹사이트에서 온라인 구매를 하는 경우 관련된 일반 판매 약관을
          준수하고 해당 약관의 적용을 받는 것에 동의하게 됩니다.
        </li>
        <li>
          이용 약관의 전체 내용에 동의하지 않는 경우 즉시 본 웹사이트 이용을 중지하여 주시기
          바랍니다.
        </li>
        <li> 본 웹사이트는 PRADA Korea LLC 와 그 모회사인 Prada S.p.A.에 의해 운영됩니다. </li>
        <li>웹 사이트에서 제공되는 제품들은 Prada Group이 직접 판매합니다</li>
        <li>
          PRADA는 자사의 단독 재량에 따라 본 웹사이트의 이용 약관을 수정할 수 있는 권한을
          보유합니다.
        </li>
      </ul>

      <ul>
        <li className="title">2. 권리 포기</li>
        <li> 본 웹사이트 및 해당 컨텐츠는 "있는 그대로" 및 "가용한 범위 내에서" 제공됩니다.</li>
        <li>이 웹사이트의 어떠한 사용도 당신 자신의 위험에 처합니다. </li>
        <li>
          당신은 적용 가능한 소비자 법에 따라 특정한 권리를 가질 수 있으며, 이 사용 약관은 그러한
          권리에 영향을 미치지 않습니다.
        </li>
        <li>
          해당 법률에서 허용하는 최대 범위까지, Prada Group은 악의적인 프로그램(바이러스 등)이나
          특정 목적에 대한 적합성에 대한 묵시적 보증을 포함하거나 포함하지 않는 명시적 또는 묵시적
          보증, 조건 및 표현을 모두 부인합니다.
        </li>
        <li>
          PRADA 또는 기타 Prada Group 회사는 어떠한 경우에도 다음에 의해 발생한 직접, 간접, 우발적,
          부수적, 재정적 또는 비 재정적 손해에 대해 책임을 지지 않습니다:
        </li>
        <li>
          본 웹사이트상에서, 또는 웹사이트를 통해 액세스된 정보의 지연, 부정확, 오류, 누락으로 인해
          유발된 손실 또는 손해를 포함하되 이에 국한되지 않는 귀하의 웹사이트 사용,
        </li>
        <li>본 웹사이트를 통하거나 본 웹사이트에서 체결된 모든 거래,</li>
        <li>
          본 웹사이트상에서, 또는 웹사이트를 통해 액세스된 정보의 전달이나 전송 실패 또는 통신
          장애를 포함하되 이에 국한되지 않는 이유로 인한 웹사이트 사용 불가,
        </li>
        <li>
          웹사이트와 관련되거나 웹사이트상에서 전달된 정보의 삭제, 수정, 손상, 손실 또는 저장 실패,
        </li>
        <li>웹사이트상에서, 또는 웹사이트를 통해 획득한 제품 또는 서비스의 사용,</li>
        <li>웹사이트에 대한 무단 액세스 및 전송 또는 데이터에 대한 무단 변경,</li>
        <li>웹사이트상의 제삼자의 진술이나 행위 또는</li>
        <li>웹사이트와 관련된 모든 기타 문제.</li>
        <li>
          Prada Group는 통지 여부와 관계없이 언제든지 일시적 또는 영구적으로 웹사이트(또는 그
          일부)를 수정 또는 사용 중단할 권리를 가집니다. 귀하는 Prada Group 웹사이트 수정, 일시 중지
          또는 사용 중단에 대해 PRADA가 귀하나 제삼자에게 배상하지 않음에 동의합니다.
        </li>
      </ul>

      <ul>
        <li className="title">3. 제출</li>
        <li>
          귀하는 본 웹사이트를 통해서나 다른 경로를 통해 우리에 공개하거나 제출한 모든 제안서,
          디자인, 콘셉트, 사진, 추천의 글, 기타 항목이나 자료(개인 정보 제외)는 비밀 유지가 되지
          않으며 귀하의 독점권이 인정되지 않음에 동의합니다.
        </li>
        <li>
          PRADA에 또는 Prada Group의 다른 회사에 제출함으로써 귀하는 Prada Group에 제출물의 저작권을
          포함한 모든 권리, 소유권, 이익을 양도하는 것이 됩니다.{' '}
        </li>
        <li>Prada Group는 다음과 같은 의무가 없습니다:</li>
        <li> (i) 제출물의 비밀 유지, </li>
        <li> (ii) 귀하 또는 누군가에게 제출물 또는 제출물 사용에 대한 보상금을 지급, </li>
        <li> (iii) 제출에 응답하거나 수령을 확인.</li>
        <li>제출물의 콘텐츠에 대한 책임은 현재는 물론 향후에도 귀하에게 단독으로 있습니다.</li>
      </ul>

      <ul>
        <li className="title">4. 쿠키</li>

        <li>
          쿠키는 웹사이트에서 효율적 기능을 보장하고, 이용자 기호에 맞춘 온라인 광고 메시지를
          발송하는 것을 포함하여 서비스를 개선하기 위해 사용됩니다.{' '}
        </li>
        <li>
          대부분의 브라우저는 쿠키를 수락하도록 설정되어 있지만, 귀하는 언제든지 모든 쿠키를
          거부하거나 새로운 쿠키가 전송될 때 귀하에게 알리도록 브라우저를 재설정할 수 있습니다.{' '}
        </li>
        <li>그러나 모든 쿠키를 거부하면 웹사이트의 특정 기능을 사용하지 못하게 될 수 있습니다.</li>
        <li>
          본 웹사이트에서 사용하는 쿠키의 유형, 쿠키 비활성 및/또는 쿠키 이용 동의 철회, 또는 기타
          자세한 정보에 대하여 **쿠키 정책**을 확인해주십시오.
        </li>
      </ul>

      <ul>
        <li className="title">5. 개인정보보호</li>
        <li>
          Prada Group는 본사 웹사이트 이용자의 개인 식별 정보("개인 데이터")의 기밀성, 무결성 및
          보안을 유지하는 것이 중요함을 이해합니다.
        </li>

        <li>
          {' '}
          웹사이트의 서비스, 활동, 기능에 참여하기 위해 개인 데이터를 제공해 줄 것을 요청받을 수도
          있습니다.
        </li>
        <li>
          이러한 웹사이트 섹션 사용을 목적으로 요청을 받게 되는 경우 귀하는 개인 데이터 처리에
          동의하고 사실이며 정확한 정보를 제공하는 데 동의함을 명시하는 관련 개인정보 보호정책을
          읽을 의무가 있습니다.
        </li>
        <p>자세한 내용은 **개인정보 처리 방침**을 참조하십시오.</p>
      </ul>

      <ul>
        <li className="title">6. 다른 웹사이트로의 링크</li>
        <li>웹사이트는 자사 이외의 웹사이트로의 링크를 포함할 수 있습니다.</li>

        <li>
          Prada Group는 그러한 웹사이트에 대해 어떠한 책임도 지지 않으며 이러한 링크는 사용자의
          편의를 위해서만 제공됩니다.
        </li>
        <li>
          Prada Group는 이러한 웹사이트와 외부 소스를 제어할 수 없습니다. 해당 법률에서 허용하는
          최대 범위까지, Prada Group는 그러한 웹사이트나 외부 소스에 대한 책임을 질 수 없으며 그러한
          웹사이트 및 외부 소스 또는 이러한 사이트에서 분화된 사이트에서 이용 가능한 콘텐츠, 광고,
          제품, 서비스 및 기타 자료에 대한 책임을 거부합니다.
        </li>
      </ul>

      <ul>
        <li className="title">7. 보안</li>
        <li>인터넷을 통한 데이터 전송은 완전히 안전하다고 보장할 수 없습니다.</li>
        <li>
          PRADA는 개인 정보를 보호하기 위해 가능한 모든 노력을 다하고 있지만 이용자가 본사에 전송한
          모든 정보의 완전한 보안을 보장할 수는 없습니다.
        </li>
        <li>
          데이터 전송은 귀하 자신의 책임 하에 이루어지며 PRADA 또는 Prada Group의 다른 회사는 Prada
          Group의 부주의한 행동에서 직접 기인하지 않은 보안 위반에 대해서는 책임을 지지 않습니다.
        </li>
      </ul>

      <ul>
        <li className="title">8. 이용 약관에 대한 동의 및 면책</li>
        <li>
          본 웹사이트에 탐색 및 사용 귀하는 본 이용 약관에 동의하며, 웹사이트를 사용할 경우 본 이용
          약관을 준수할 것임을 진술하며 보증합니다.
        </li>
        <li>
          귀하는 이용 약관의 위반 또는 귀하의 웹사이트 사용과 관련되거나 이로 인해 발생한 모든 손해,
          비용, 부채, 소송, 판결, 처벌, 경비, 의무, 손실, 청구, 법적 조치, 비용 및 지출(변호사
          수임료 및 경비를 포함하되 이에 국한되지 않음)로부터 Prada Group를 법률적으로 면책함에
          동의합니다.
        </li>
      </ul>

      <p className="upDate">최종 업데이트: 2020년 05월 14일</p>
    </div>
  );
};

export default TermsOfService;
